CSI API ETABS v1
cDetailing.GetDetailedColumnStackData_1 Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedColumnStackData_1(
	string ColumnStackID,
	ref string[] ObjectUniqueNames,
	ref int NumLongBarSets,
	ref int[] NumLongBars,
	ref string[] LongBarGUID,
	ref double[] LongBarDiameter,
	ref string[] LongBarNotation,
	ref double[] LongBarStartDist,
	ref int[] LongBarStartBend,
	ref int[] LongBarEndBend,
	ref double[] LongBarLength,
	ref int[] LongBarNumLayers,
	ref int NumTieZones,
	ref string[] TieBarZones,
	ref int[] NumTieBars,
	ref int[] NumTieHorLegs,
	ref int[] NumTieVertLegs,
	ref string[] TieBarGUID,
	ref double[] TieBarDiameter,
	ref string[] TieBarNotation,
	ref double[] TieBarStartDist,
	ref double[] TieBarSpacing,
	ref int[] TieBarType
)
Function GetDetailedColumnStackData_1 (
	ColumnStackID As String,
	ByRef ObjectUniqueNames As String(),
	ByRef NumLongBarSets As Integer,
	ByRef NumLongBars As Integer(),
	ByRef LongBarGUID As String(),
	ByRef LongBarDiameter As Double(),
	ByRef LongBarNotation As String(),
	ByRef LongBarStartDist As Double(),
	ByRef LongBarStartBend As Integer(),
	ByRef LongBarEndBend As Integer(),
	ByRef LongBarLength As Double(),
	ByRef LongBarNumLayers As Integer(),
	ByRef NumTieZones As Integer,
	ByRef TieBarZones As String(),
	ByRef NumTieBars As Integer(),
	ByRef NumTieHorLegs As Integer(),
	ByRef NumTieVertLegs As Integer(),
	ByRef TieBarGUID As String(),
	ByRef TieBarDiameter As Double(),
	ByRef TieBarNotation As String(),
	ByRef TieBarStartDist As Double(),
	ByRef TieBarSpacing As Double(),
	ByRef TieBarType As Integer()
) As Integer
Dim instance As cDetailing
Dim ColumnStackID As String
Dim ObjectUniqueNames As String()
Dim NumLongBarSets As Integer
Dim NumLongBars As Integer()
Dim LongBarGUID As String()
Dim LongBarDiameter As Double()
Dim LongBarNotation As String()
Dim LongBarStartDist As Double()
Dim LongBarStartBend As Integer()
Dim LongBarEndBend As Integer()
Dim LongBarLength As Double()
Dim LongBarNumLayers As Integer()
Dim NumTieZones As Integer
Dim TieBarZones As String()
Dim NumTieBars As Integer()
Dim NumTieHorLegs As Integer()
Dim NumTieVertLegs As Integer()
Dim TieBarGUID As String()
Dim TieBarDiameter As Double()
Dim TieBarNotation As String()
Dim TieBarStartDist As Double()
Dim TieBarSpacing As Double()
Dim TieBarType As Integer()
Dim returnValue As Integer
returnValue = instance.GetDetailedColumnStackData_1(ColumnStackID,
	ObjectUniqueNames, NumLongBarSets,
	NumLongBars, LongBarGUID, LongBarDiameter,
	LongBarNotation, LongBarStartDist,
	LongBarStartBend, LongBarEndBend,
	LongBarLength, LongBarNumLayers,
	NumTieZones, TieBarZones, NumTieBars,
	NumTieHorLegs, NumTieVertLegs, TieBarGUID,
	TieBarDiameter, TieBarNotation,
	TieBarStartDist, TieBarSpacing,
	TieBarType)
int GetDetailedColumnStackData_1(
	String^ ColumnStackID,
	array<String^>^% ObjectUniqueNames,
	int% NumLongBarSets,
	array<int>^% NumLongBars,
	array<String^>^% LongBarGUID,
	array<double>^% LongBarDiameter,
	array<String^>^% LongBarNotation,
	array<double>^% LongBarStartDist,
	array<int>^% LongBarStartBend,
	array<int>^% LongBarEndBend,
	array<double>^% LongBarLength,
	array<int>^% LongBarNumLayers,
	int% NumTieZones,
	array<String^>^% TieBarZones,
	array<int>^% NumTieBars,
	array<int>^% NumTieHorLegs,
	array<int>^% NumTieVertLegs,
	array<String^>^% TieBarGUID,
	array<double>^% TieBarDiameter,
	array<String^>^% TieBarNotation,
	array<double>^% TieBarStartDist,
	array<double>^% TieBarSpacing,
	array<int>^% TieBarType
)
abstract GetDetailedColumnStackData_1 :
        ColumnStackID : string *
        ObjectUniqueNames : string[] byref *
        NumLongBarSets : int byref *
        NumLongBars : int[] byref *
        LongBarGUID : string[] byref *
        LongBarDiameter : float[] byref *
        LongBarNotation : string[] byref *
        LongBarStartDist : float[] byref *
        LongBarStartBend : int[] byref *
        LongBarEndBend : int[] byref *
        LongBarLength : float[] byref *
        LongBarNumLayers : int[] byref *
        NumTieZones : int byref *
        TieBarZones : string[] byref *
        NumTieBars : int[] byref *
        NumTieHorLegs : int[] byref *
        NumTieVertLegs : int[] byref *
        TieBarGUID : string[] byref *
        TieBarDiameter : float[] byref *
        TieBarNotation : string[] byref *
        TieBarStartDist : float[] byref *
        TieBarSpacing : float[] byref *
        TieBarType : int[] byref -> int
Parameters
ColumnStackID
Type: System.String
ObjectUniqueNames
Type: System.String[]
NumLongBarSets
Type: System.Int32
NumLongBars
Type: System.Int32[]
LongBarGUID
Type: System.String[]
LongBarDiameter
Type: System.Double[]
LongBarNotation
Type: System.String[]
LongBarStartDist
Type: System.Double[]
LongBarStartBend
Type: System.Int32[]
LongBarEndBend
Type: System.Int32[]
LongBarLength
Type: System.Double[]
LongBarNumLayers
Type: System.Int32[]
NumTieZones
Type: System.Int32
TieBarZones
Type: System.String[]
NumTieBars
Type: System.Int32[]
NumTieHorLegs
Type: System.Int32[]
NumTieVertLegs
Type: System.Int32[]
TieBarGUID
Type: System.String[]
TieBarDiameter
Type: System.Double[]
TieBarNotation
Type: System.String[]
TieBarStartDist
Type: System.Double[]
TieBarSpacing
Type: System.Double[]
TieBarType
Type: System.Int32[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace